describe('ToDo Component測試', () => {
  it('若為優先事項 mark不同顏色', () => {

  });

  it('顯示未完成項目數量', () => {

  });

  it('若有指定日期則顯示於副標題', () => {

  });

  it('若有指定日期則顯示於副標題', () => {

  });

  it('若mark完成，則顯示標題為刪除線', ()=>{

  });

  it('點選優先星星，則標題列變成#FFF2DC', ()=>{

  });
  it('點選優先星星，則icon變成#F5A623',()=>{

  });
  it('點選優先星星，該項置頂',()=>{

  });
  it('雙擊後才能編輯Comment',()=>{

  });

  it('儲存按鈕hover顏色#3982D7',()=>{

  });

  it('點選編輯圖示或點選標題，變成編輯狀態，並展開編輯畫面',()=>{

  });

  it('點選取消，取消編輯狀態，並收起編輯畫面', ()=>{

  })

  it('取消按鈕hover顏色#FDFDFD',()=>{
    
  })
  
  it()
});
